---
title:  "pandas 행과 열 삭제"
# categories:
#   - Blog
tags: [python, pandas]

# toc: true
# toc_sticky: true
# toc_label: "페이지 목차"
---

### 데이타프레임 생성

In [15]:
import pandas as pd
df = pd.read_csv("supermarkets.csv")
df.set_index("Address", inplace = True)
df

,ID,City,State,Country,Name,Employees
Address,,,,,,
3666 21st St,1,San Francisco,CA 94114,USA,Madeira,8
735 Dolores St,2,San Francisco,CA 94119,USA,Bready Shop,15
332 Hill St,3,San Francisco,California 94114,USA,Super River,25

### 열 삭제
+ 판다스에서 행은 axis=0이며 열은 axis=1로 지정한다
+ 열 지정 시에 axis='columns'도 가능
+ 디폴트 값이 axis=0이기 때문에 행을 삭제할 경우 생략 가능하다

In [16]:
df.drop("City", axis=1)

                ID             State Country         Name  Employees
Address
3666 21st St     1          CA 94114     USA      Madeira          8
735 Dolores St   2          CA 94119     USA  Bready Shop         15
332 Hill St      3  California 94114     USA  Super River         25

### 행 삭제
+ axis='rows'를 사용해도 된다

In [17]:
df.drop("735 Dolores St", axis=0)

,ID,City,State,Country,Name,Employees
Address,,,,,,
3666 21st St,1,San Francisco,CA 94114,USA,Madeira,8
332 Hill St,3,San Francisco,California 94114,USA,Super River,25

In [18]:
df

,ID,City,State,Country,Name,Employees
Address,,,,,,
3666 21st St,1,San Francisco,CA 94114,USA,Madeira,8
735 Dolores St,2,San Francisco,CA 94119,USA,Bready Shop,15
332 Hill St,3,San Francisco,California 94114,USA,Super River,25

### 행 범위 삭제

In [19]:
df.drop(df.index[1:3], axis=0)

              ID           City     State Country     Name  Employees
Address
3666 21st St   1  San Francisco  CA 94114     USA  Madeira          8

### 열 범위 삭제

In [20]:
df.drop(df.columns[1:3], axis=1)

                ID Country         Name  Employees
Address
3666 21st St     1     USA      Madeira          8
735 Dolores St   2     USA  Bready Shop         15
332 Hill St      3     USA  Super River         25